project-root/app/Models/BooksModel.php

SELECT *
FROM `books`
SELECT *
FROM `books`
WHERE `slug` = 'lukisan-senja'
 LIMIT 1
---
    public function getBuku($slug = false) {
        if ($slug == false) {
            return $this->findAll();
        }
        return $this->where(['slug' => $slug])->first();